web/app/controllers/torrents_controller.rb

SELECT * FROM "torrents" WHERE ("torrents"."id" = 2)
---
  def show
     begin
         @torrent = Torrent.find(params[:id])

SELECT * FROM "torrents" WHERE ("torrents"."id" = 2)
DELETE FROM "torrents" WHERE "id" = 2
---
  def destroy
    @torrent = Torrent.find(params[:id])
    @torrent.destroy

INSERT INTO "torrents" ("name", "size", "updated_at", "meta_info", "created_at", "data") VALUES('Shashank_Agarwal.pdf', 33967, '2009-01-26 23:24:50', NULL, '2009-01-26 23:24:50', '%25PDF-1.4
---
  def uploadTorrentFile
   #post = Torrent.updatetorrentfile(params[:upload])
   @torrent = Torrent.new(params[:torrent])
   @torrent.name = params[:upload]['torrentfile'].original_filename
   @torrent.size = params[:upload]['torrentfile'].size
   @torrent.meta_info = params[:upload]['torrentfile'].read
   respond_to do |format|
     if @torrent.save

SELECT * FROM "torrents" WHERE ("torrents"."id" = 1)
---
  def downloadTorrentFile

      @torrent = Torrent.find(params[:id])