web/app/controllers/torrents_controller.rb

  def index
    #ordering = handle_sort params

    uid = session[:user_id]

    @torrents = Torrent.get_torrents_for_user(uid)

    #Sort this stuff!
    if @torrents
       case params[:c]
       when "category_id"
	  @torrents = @torrents.sort_by { |torrent| torrent.category_id }
       when "size"
	  @torrents = @torrents.sort_by { |torrent| torrent.size }
---
SELECT * FROM "torrents"