web/app/controllers/users_controller.rb

  def show
    return if invalid_id params[:id]
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new({"fb_id" =>  params[:user]["fb_id"]})
    @user.save()
---
INSERT INTO "users" ("updated_at", "fb_id", "created_at") VALUES('2009-01-23 20:30:36', 'beepbeep', '2009-01-23 20:30:36')